Autodesk.Revit.DB.ExportLinetypeTable.GetEnumerator
Returns an enumerator that iterates through a collection.
Returns: An IEnumerator object that can be used to iterate through the collection.

Autodesk.Revit.DB.ExportLinetypeTable.GetBasicIEnumerator
Returns an enumerator that iterates through a collection.
Returns: An IEnumerator object that can be used to iterate through the collection.

Autodesk.Revit.DB.ExportLinetypeTable.GetExportLinetypeTableIterator
Returns a line type table iterator to the line type table.

Autodesk.Revit.DB.ExportLinetypeTable.Clear
Removes all contents stored in Export line type table.

Autodesk.Revit.DB.ExportLinetypeTable.Remove(Autodesk.Revit.DB.ExportLinetypeKey)
Removes the pair (key, info) corresponding to the given ExportLinetypeKey.
exportLinetypeKey:
The export line type key
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL

Autodesk.Revit.DB.ExportLinetypeTable.Add(Autodesk.Revit.DB.ExportLinetypeKey,Autodesk.Revit.DB.ExportLinetypeInfo)
Inserts a (key, info) pair into Export line type table.
exportLinetypeKey:
The export line type Key to be added.
exportLinetypeInfo:
The export line type info to be added.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The key already exists in the table.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL

Autodesk.Revit.DB.ExportLinetypeTable.GetValues
Returns all the values stored in the map.
Returns:
The info.

Autodesk.Revit.DB.ExportLinetypeTable.GetKeys
Gets all the keys stored in the map.
Returns:
The keys.

Autodesk.Revit.DB.ExportLinetypeTable.GetExportLinetypeInfo(Autodesk.Revit.DB.ExportLinetypeKey)
Gets a copy of the ExportLinetypeInfo corresponding to the given ExportLinetypeKey.
exportLinetypeKey:
The export line type Key.
Returns:
Returns the line type info for this key.
Throws Autodesk.Revit.Exceptions.ArgumentException:
An entry with the given key is not present in the table.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL

Autodesk.Revit.DB.ExportLinetypeTable.ContainsKey(Autodesk.Revit.DB.ExportLinetypeKey)
Checks whether a pattern key exists in the table.
exportLinetypeKey:
The export line type key.
Returns:
True if the line type exists in the table.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL

Autodesk.Revit.DB.ExportLinetypeTable.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.ExportLinetypeTable.Count
Count of the items contained in the collection.

Autodesk.Revit.DB.ExportLinetypeTable.default(Autodesk.Revit.DB.ExportLinetypeKey)
A copy of the Autodesk.Revit.DB.ExportLinetypeInfo for the linetype's Autodesk.Revit.DB.ExportLinetypeKey.
Remarks: When getting this property, it returns a copy of the Autodesk.Revit.DB.ExportLinetypeInfo from the table.  In order to
make changes to the Autodesk.Revit.DB.ExportLinetypeInfo and use those settings during export, set the modified
Autodesk.Revit.DB.ExportLinetypeInfo back into the table using the same key.
exportLinetypeKey:
The key.
Returns:
A copy of the Autodesk.Revit.DB.ExportLinetypeInfo.
Throws Autodesk.Revit.Exceptions.ArgumentException: When getting this property:
An entry with the given key is not present in the table.
Since:
2014

Autodesk.Revit.DB.ExportLinetypeTable.GetLinetypeTableIterator
Returns a ExportLinetypeTableIterator that iterates through the collection.
Returns: A ExportLinetypeTableIterator object that can be used to iterate through key-value pairs in the collection.

Autodesk.Revit.DB.ExportLinetypeTable.#ctor
Constructs a new ExportLinetypeTable with default values.

Autodesk.Revit.DB.ExportLinetypeTable
A table supporting a mapping of linetypes in Revit to linetype names that will be set
in the target export format.
Remarks:
This table is structured as a mapping from Autodesk.Revit.DB.ExportLinetypeKey to
Autodesk.Revit.DB.ExportLinetypeInfo members.  The Autodesk.Revit.DB.ExportLinetypeKey
contains the indentification information for the pattern table: the Revit linetype name.  The
Autodesk.Revit.DB.ExportLinetypeInfo contains the linetype name to use in the export format.
The table can be accessed via direct iteration as a collection of KeyValuePairs, or by traversal of the stored keys
obtained from GetKeys(), or via specific lookup of a key constructed externally.  In all cases, the
Autodesk.Revit.DB.ExportLinetypeInfo returned will be a copy of the Autodesk.Revit.DB.ExportLinetypeInfo
from the table.  In order to make changes to the Autodesk.Revit.DB.ExportLinetypeInfo and use those settings during export,
set the modified Autodesk.Revit.DB.ExportLinetypeInfo back into the table using the same key.